1. read_csv()
2. to_csv()
3. head()
4. tail()
5. info()
6. describe()
7. shape
8. columns
9. dtypes
10. isnull()
11. dropna()
12. fillna()
13. drop()
14. rename()
15. sort_values()
16. groupby()
17. merge()
18. concat()
19. pivot_table()
20. value_counts()
21. unique()
22. duplicated()
23. drop_duplicates()
24. melt()
25. pivot()
26. set_index()
27. reset_index()
28. sample()
29. nlargest()
30. nsmallest()
31. astype()
32. iloc()
33. isin()
34. corr()
35. hist()
36. plot()
37. boxplot()
38. resample()
39. get_dummies()
40. to_datetime()
41. to_numeric()
42. read_excel()
43. to_excel()

In [8]:
import pandas as pd
import numpy as np

## Melt
## Pviot Table

In [4]:
a=pd.DataFrame(
    {
        'branch':['cse','ece','mech'],
        '2020':[100,150,60],
        '2021':[120,130,80],
        '2022':[150,140,70]
    }
)
a

  branch  2020  2021  2022
0    cse   100   120   150
1    ece   150   130   140
2   mech    60    80    70

In [7]:
a.melt(id_vars=['branch'],var_name='Year',value_name='values')

  branch  Year  values
0    cse  2020     100
1    ece  2020     150
2   mech  2020      60
3    cse  2021     120
4    ece  2021     130
5   mech  2021      80
6    cse  2022     150
7    ece  2022     140
8   mech  2022      70

## Reallife Example

In [8]:
df=pd.read_csv('248a92b9-5817-43f2-b0e7-6d45a45a8ee9.csv')
df.head()

,_id,Year,Offence,Punjab,Sindh,KP,Balochistan,Islamabad,Railways,G.B,AJK,Pakistan
0,1,2012,Murder,6128,3726,2958,711,120,6,102,95,13846
1,2,2012,Attempt to Murder,7641,3732,2892,583,146,9,163,172,15338
2,3,2012,Kidnapping /Abduction,15699,3077,1052,386,70,6,32,288,20610
3,4,2012,Dacoity,2715,1341,60,98,22,1,8,12,4257
4,5,2012,Robbery,12181,4320,134,160,177,5,26,78,17081

In [10]:
df=df.melt(id_vars=['_id','Year','Offence','Pakistan'])
df.head()

   _id  Year                Offence  Pakistan variable  value
0    1  2012                 Murder     13846   Punjab   6128
1    2  2012      Attempt to Murder     15338   Punjab   7641
2    3  2012  Kidnapping /Abduction     20610   Punjab  15699
3    4  2012                Dacoity      4257   Punjab   2715
4    5  2012                Robbery     17081   Punjab  12181

In [16]:
mur=df[df['Offence']=='Murder']
mur.groupby('variable')['value'].sum().sort_values(ascending=False).reset_index()

      variable  value
0       Punjab  30381
1           KP  16643
2        Sindh  15566
3  Balochistan   3084
4    Islamabad    689
5          AJK    477
6          G.B    431
7     Railways     25

## Pviot Table

In [10]:
import seaborn as sns

In [11]:
tip=sns.load_dataset('tips')
tip.head()

   total_bill   tip     sex smoker  day    time  size
0       16.99  1.01  Female     No  Sun  Dinner     2
1       10.34  1.66    Male     No  Sun  Dinner     3
2       21.01  3.50    Male     No  Sun  Dinner     3
3       23.68  3.31    Male     No  Sun  Dinner     2
4       24.59  3.61  Female     No  Sun  Dinner     4

In [13]:
tip.pivot_table(values='tip', index='smoker', columns='sex')

C:\Users\Lucky Computer\AppData\Local\Temp\ipykernel_12496\3476458783.py:1: FutureWarning: The default value of observed=False is deprecated and will change to observed=True in a future version of pandas. Specify observed=False to silence this warning and retain the current behavior
  tip.pivot_table(values='tip', index='smoker', columns='sex')

sex         Male    Female
smoker
Yes     3.051167  2.931515
No      3.113402  2.773519

#### nlargest
#### nsmallest

In [24]:
import pandas as pd

# Sample DataFrame
data = {
    'Fruit': ['Apple', 'Banana', 'Mango', 'Orange', 'Pineapple'],
    'Quantity': [10, 20, 15, 8, 25]
}
df = pd.DataFrame(data)
df

       Fruit  Quantity
0      Apple        10
1     Banana        20
2      Mango        15
3     Orange         8
4  Pineapple        25

In [28]:
df.nsmallest(5,'Quantity')

       Fruit  Quantity
3     Orange         8
0      Apple        10
2      Mango        15
1     Banana        20
4  Pineapple        25

### set_index()

In [39]:
import pandas as pd

# Sample DataFrame
data = {
    'Fruit': ['Apple', 'Banana', 'Mango', 'Orange', 'Pineapple'],
    'Quantity': [10, 20, 15, 8, 25]
}
df = pd.DataFrame(data)
df.to_csv('fruit.csv')

In [31]:
df=df.set_index('Fruit')
df.columns

Index(['Quantity'], dtype='object')

In [2]:
import pandas as pd

# Sample data
data = {
    'fruit': ['Apple', 'Banana', 'Cherry', 'Date', 'Elderberry'],
    'price': [1.2, 0.5, 2.5, 3.0, 1.75]
}

# Create DataFrame
df = pd.DataFrame(data)

# Display the DataFrame
display(df)

        fruit  price
0       Apple   1.20
1      Banana   0.50
2      Cherry   2.50
3        Date   3.00
4  Elderberry   1.75

In [3]:
import pandas as pd

# Sample data
data = {
    'fruit': ['Apple', 'Banana', 'Cherry', 'Date', 'Apple', 'Banana', 'Cherry'],
    'price': [1.2, 0.5, 2.5, 3.0, 1.3, 0.6, 2.6]
}

# Create DataFrame
df = pd.DataFrame(data)

# Group by 'fruit' and calculate the average price
grouped_df = df.groupby('fruit')['price'].mean().reset_index()

# Display the grouped DataFrame
display(grouped_df)

    fruit  price
0   Apple   1.25
1  Banana   0.55
2  Cherry   2.55
3    Date   3.00

In [4]:
import pandas as pd

# Sample data
data = {
    'fruit': ['Apple', 'Banana', 'Cherry', 'Date'],
    'price_2022': [1.2, 0.5, 2.5, 3.0],
    'price_2023': [1.3, 0.6, 2.6, 3.1]
}

# Create DataFrame
df = pd.DataFrame(data)

# Display the original DataFrame
print("Original DataFrame:")
print(df)

# Melt the DataFrame
melted_df = pd.melt(df, id_vars=['fruit'], var_name='year', value_name='price')

# Display the melted DataFrame
print("\nMelted DataFrame:")
print(melted_df)

Original DataFrame:
    fruit  price_2022  price_2023
0   Apple         1.2         1.3
1  Banana         0.5         0.6
2  Cherry         2.5         2.6
3    Date         3.0         3.1

Melted DataFrame:
    fruit        year  price
0   Apple  price_2022    1.2
1  Banana  price_2022    0.5
2  Cherry  price_2022    2.5
3    Date  price_2022    3.0
4   Apple  price_2023    1.3
5  Banana  price_2023    0.6
6  Cherry  price_2023    2.6
7    Date  price_2023    3.1